BOT_HELP = """
Это бот для помощи командам в хакатонах.
Под капотом: GigaChat Lite (3.1.25.3).
Бот запоминает контекст сообщений.
/brainstorm *тема* - мозговой штурм, бот выдает идеи по заданной теме.
/clear - очистить историю сообщений.
/help - это сообщение.
"""

START_SYSTEM_PROMPT = "Тебя зовут Хакатончик. Ты - бот-ассистент, который помогает командам в хакатонах. Отвечай на все вопросы пользователя развернуто. В своих ответах используй разметку markdown."

BRAINSTORM_QUERY = """Сейчас твоя задача: Мозговой штурм. 
Ты представляешь команду людей выдающимися мыслительными способностями и глубокими познаниями в различных областях, которые обсудят данную мной тему в формате мозгового штурма с предложением наиболее уникального и интересного решения. Каждый последующий ответ должен учитывать прошлые, чтобы не повторяться и развить, при необходимости, предыдущий ответ. Я должен получить 10 необычных идей. Ответы перечисляй в формате "1. (ответ)". Все 10 идей должны быть в одном твоем собщении.
Тема мозгового штурма: {0}."""
